# CourseData Tests

In [5]:
%load_ext sql

In [6]:
%%sql 
sqlite:///CourseData.db

'Connected: @CourseData.db'

## Domain Integrity Checks

In [7]:
%%sql
-- Checks database tables and columns within

SELECT * FROM sqlite_master;

 * sqlite:///CourseData.db
Done.

[('table', 'PROFESSORS', 'PROFESSORS', 2, 'CREATE TABLE PROFESSORS (\n    Professor_id INTEGER PRIMARY KEY,\n    Name TEXT NOT NULL\n)'),
 ('table', 'PROGRAMS', 'PROGRAMS', 3, 'CREATE TABLE PROGRAMS (\n    Program_id INTEGER PRIMARY KEY,\n    program_code TEXT NOT NULL,\n    program_name TEXT NOT NULL\n)'),
 ('table', 'LOCATIONS', 'LOCATIONS', 4, 'CREATE TABLE LOCATIONS (\n    Location_id INTEGER PRIMARY KEY,\n    location TEXT NOT NULL\n)'),
 ('table', 'COURSES', 'COURSES', 5, 'CREATE TABLE COURSES (\n    Course_id INTEGER PRIMARY KEY, \n    CatalogYear TEXT NOT NULL,\n    Catalog_id TEXT NOT NULL,\n    Course_title TEXT NOT ... (81 characters truncated) ... Coreqs TEXT,\n    Description TEXT,\n    Fee TEXT,\n    Program_id INTEGER NOT NULL,\n    FOREIGN KEY (Program_id) REFERENCES PROGRAMS(Program_id)\n)'),
 ('table', 'COURSE_OFFERINGS', 'COURSE_OFFERINGS', 6, 'CREATE TABLE COURSE_OFFERINGS (\n    Offering_id INTEGER PRIMARY KEY,\n    CatalogYear TEXT,\n    Term TEXT NOT NULL,\n    Section TEXT NOT NULL,\n   ... (228 characters truncated) ... ofessor_id INTEGER,\n    FOREIGN KEY (Professor_id) REFERENCES PROFESSORS(Professor_id)\n    FOREIGN KEY (Course_id) REFERENCES COURSES(Course_id)\n)'),
 ('table', 'MEETINGS', 'MEETINGS', 7, 'CREATE TABLE MEETINGS (\n    Meetings_id INTEGER PRIMARY KEY,\n    Day TEXT,\n    Start TEXT NOT NULL,\n    End TEXT NOT NULL,\n    Location_id INTEG ... (30 characters truncated) ... INTEGER,\n    FOREIGN KEY (Location_id) REFERENCES LOCATIONS(Location_id),\n    FOREIGN KEY (Offering_id) REFERENCES COURSE_OFFERINGS(Offering_id)\n)'),
 ('table', 'CATALOG_YEAR', 'CATALOG_YEAR', 8, 'CREATE TABLE CATALOG_YEAR (\n    CatalogYear TEXT,\n    Term TEXT\n)'),
 ('table', 'IMPORT_CATALOG_COURSES', 'IMPORT_CATALOG_COURSES', 9, 'CREATE TABLE "IMPORT_CATALOG_COURSES" (\n"program_code" TEXT,\n  "program_name" TEXT,\n  "catalog_id" TEXT,\n  "course_title" TEXT,\n  "credits" TEXT,\n  "prereqs" TEXT,\n  "coreqs" TEXT,\n  "fees" TEXT,\n  "attributes" TEXT,\n  "description" TEXT,\n  "cat_year" TEXT\n)'),
 ('table', 'IMPORT_COURSE_MEETINGS', 'IMPORT_COURSE_MEETINGS', 751, 'CREATE TABLE "IMPORT_COURSE_MEETINGS" (\n"term" TEXT,\n  "crn" INTEGER,\n  "location" TEXT,\n  "day" TEXT,\n  "start" TEXT,\n  "end" TEXT\n)'),
 ('table', 'IMPORT_COURSE_OFFERINGS', 'IMPORT_COURSE_OFFERINGS', 5733, 'CREATE TABLE "IMPORT_COURSE_OFFERINGS" (\n"term" TEXT,\n  "crn" INTEGER,\n  "catalog_id" TEXT,\n  "section" TEXT,\n  "credits" TEXT,\n  "title" TEXT,\n  "meetings" TEXT,\n  "timecodes" TEXT,\n  "primary_instructor" TEXT,\n  "cap" INTEGER,\n  "act" INTEGER,\n  "rem" INTEGER,\n  "cat_year" TEXT\n)')]

In [8]:

%%sql
--Confirm that correct num of records retrieved

SELECT 
    (SELECT Count(*) FROM COURSES) as CatalogCourses,
    (SELECT Count(*) FROM COURSE_OFFERINGS) as CourseOfferings,
    (SELECT Count(*) FROM MEETINGS) as CourseMeetings

 * sqlite:///CourseData.db
Done.

[(4440, 15937, 284847)]

## Entity Integrity Checks

In [9]:

%%sql 
-- Testing PROFESSORS Table to retrieve unique values

SELECT *
FROM PROFESSORS
WHERE Name LIKE '%Huntley';

 * sqlite:///CourseData.db
Done.

[(275, 'Christopher L.  Huntley')]

In [10]:
%%sql 
-- Testing PROGRAMS Table to retrieve a unique value

SELECT *
FROM PROGRAMS
WHERE program_name LIKE '%Systems';

 * sqlite:///CourseData.db
Done.

[(47, 'IS', 'Information Systems')]

In [7]:
%%sql
SELECT count (Program_name)
FROM PROGRAMS;

 * sqlite:///CourseData.db
Done.

[(83,)]

In [11]:

%%sql 
-- Testing LOCATIONS Table for unique values

SELECT *
FROM LOCATIONS
WHERE location LIKE 'DSB%';

 * sqlite:///CourseData.db
Done.

[(98, 'DSB 104'),
 (99, 'DSB 105'),
 (100, 'DSB 106'),
 (101, 'DSB 107'),
 (102, 'DSB 108'),
 (103, 'DSB 109'),
 (104, 'DSB 110'),
 (105, 'DSB 110A'),
 (106, 'DSB 110B'),
 (107, 'DSB 111'),
 (108, 'DSB 112'),
 (109, 'DSB 114'),
 (110, 'DSB 115'),
 (111, 'DSB 2109A')]

In [12]:
%%sql 
-- Testing COURSES Table to retrieve specific courses

SELECT *
FROM COURSES
GROUP BY Course_title
HAVING Course_title LIKE '%Intelligence';

 * sqlite:///CourseData.db
Done.

[(1679, '2017_2018', 'CS 0355', 'Artificial Intelligence', '3 Credits', None, 'CS 0232.', None, 'This course, which examines computer implementation of processes of thought, includes knowledge representation, games, theorem proving, heuristics, symbolic techniques, neural networks, genetic algorithms, and artificial life.', None, 19),
 (583, '2017_2018', 'SW 0518', 'Data Mining and Business Intelligence', '3 Credits', None, None, None, 'This course examines business intelligence concepts, methods and processes used to improve data-centric business decision support solutions with a pa ... (395 characters truncated) ... ing the course we will also discuss knowledge management, how organizations manage and use the knowledge that they acquire, and presentation of data.', None, 80)]

In [13]:
%%sql 
-- Testing COURSE_OFFERINGS Table to ensure it holds all years

SELECT DISTINCT term
FROM COURSE_OFFERINGS
--WHERE program_name LIKE '%Systems';

 * sqlite:///CourseData.db
Done.

[('Fall2014',),
 ('Fall2015',),
 ('Fall2016',),
 ('Fall2017',),
 ('Fall2018',),
 ('Spring2015',),
 ('Spring2016',),
 ('Spring2017',),
 ('Spring2018',),
 ('Spring2019',),
 ('SpringBreak2017',),
 ('Summer2015',),
 ('Summer2016',),
 ('Summer2017',),
 ('Summer2018',),
 ('Winter2015',),
 ('Winter2016',),
 ('Winter2017',),
 ('Winter2018',)]

In [14]:
%%sql 
-- Testing MEETINGS Table to retrieve a unique value

SELECT DISTINCT *
FROM MEETINGS
WHERE start LIKE '%8:00:00'
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00', 99, 1),
 (2, 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00', 99, 1),
 (3, 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00', 99, 1),
 (4, 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00', 99, 1),
 (5, 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00', 99, 1),
 (6, 'F', '2014-09-19T08:00:00', '2014-09-19T09:15:00', 99, 1),
 (7, 'T', '2014-09-23T08:00:00', '2014-09-23T09:15:00', 99, 1),
 (8, 'F', '2014-09-26T08:00:00', '2014-09-26T09:15:00', 99, 1),
 (9, 'T', '2014-09-30T08:00:00', '2014-09-30T09:15:00', 99, 1),
 (10, 'F', '2014-10-03T08:00:00', '2014-10-03T09:15:00', 99, 1)]

## Relational Integrity Checks

In [15]:
%%sql
--Does Catalog_ID make sense with Program_Code & Program_Name?

SELECT catalog_ID,Course_Title,program_code,program_name
FROM COURSES
    LEFT JOIN PROGRAMS USING (program_id)
    LIMIT 5;

 * sqlite:///CourseData.db
Done.

[('AN 0301', 'Independent Study', 'AN', 'Asian Studies'),
 ('AN 0310', 'Asian Studies Seminar', 'AN', 'Asian Studies'),
 ('BU 0211', 'Legal Environment of Business', 'BU', 'Business'),
 ('BU 0220', 'Environmental Law and Policy', 'BU', 'Business'),
 ('BU 0311', 'The Law of Contracts, Sales, and Property', 'BU', 'Business')]

## Check that Professor Lane teaches Economics classes

In [16]:
%%sql
SELECT Name,Title,Section,Term
FROM PROFESSORS
    JOIN COURSE_OFFERINGS USING (professor_ID)
    WHERE Name LIKE '%Lane%'
    ORDER BY Term
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('Philip J.  Lane', 'Introduction to Microeconomics', 'C', 'Fall2014'),
 ('Philip J.  Lane', 'Money and Banking', 'A', 'Fall2014'),
 ('Philip J.  Lane', 'Independent Study-  201409', 'A', 'Fall2014'),
 ('Philip J.  Lane', 'Internship-201409', 'A', 'Fall2014'),
 ('Philip J.  Lane', 'Senior Seminar', 'A', 'Fall2014'),
 ('Philip J.  Lane', 'Introduction to Microeconomics', 'C02', 'Fall2015'),
 ('Philip J.  Lane', 'Money and Banking', 'A', 'Fall2015'),
 ('Philip J.  Lane', 'Independent Study', 'PL', 'Fall2015'),
 ('Philip J.  Lane', 'Internship', 'A', 'Fall2015'),
 ('Philip J.  Lane', 'Senior Seminar', 'A', 'Fall2015')]

## Check that Title and Course_Title are the same?

In [17]:
%%sql
SELECT Crn,Term,Title,COURSES.Catalog_ID,COURSES.Course_Title
FROM COURSE_OFFERINGS
     JOIN COURSES USING(course_ID)
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('71188', 'Fall2017', 'Introduction to Financial Accounting', 'AC 0011', 'Introduction to Financial Accounting'),
 ('71205', 'Fall2017', 'Introduction to Financial Accounting', 'AC 0011', 'Introduction to Financial Accounting'),
 ('71206', 'Fall2017', 'Introduction to Financial Accounting', 'AC 0011', 'Introduction to Financial Accounting'),
 ('71207', 'Fall2017', 'Introduction to Financial Accounting', 'AC 0011', 'Introduction to Financial Accounting'),
 ('71208', 'Fall2017', 'Introduction to Financial Accounting', 'AC 0011', 'Introduction to Financial Accounting'),
 ('71209', 'Fall2017', 'Introduction to Financial Accounting', 'AC 0011', 'Introduction to Financial Accounting'),
 ('71371', 'Fall2017', 'Introduction to Financial Accounting', 'AC 0011', 'Introduction to Financial Accounting'),
 ('71384', 'Fall2017', 'Introduction to Financial Accounting', 'AC 0011', 'Introduction to Financial Accounting'),
 ('71572', 'Fall2017', 'Introduction to Financial Accounting', 'AC 0011', 'Introduction to Financial Accounting'),
 ('71804', 'Fall2017', 'Introduction to Financial Accounting', 'AC 0011', 'Introduction to Financial Accounting')]

## Check that Day, Start and End match Meetings

In [18]:
%%sql
SELECT COURSE_OFFERINGS.Crn,Day,Start,End,COURSE_OFFERINGS.Section,Meetings
FROM MEETINGS
    JOIN COURSE_OFFERINGS USING (Offering_ID)
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('70384', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]"),
 ('70384', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]"),
 ('70384', 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]"),
 ('70384', 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]"),
 ('70384', 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]"),
 ('70384', 'F', '2014-09-19T08:00:00', '2014-09-19T09:15:00', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]"),
 ('70384', 'T', '2014-09-23T08:00:00', '2014-09-23T09:15:00', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]"),
 ('70384', 'F', '2014-09-26T08:00:00', '2014-09-26T09:15:00', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]"),
 ('70384', 'T', '2014-09-30T08:00:00', '2014-09-30T09:15:00', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]"),
 ('70384', 'F', '2014-10-03T08:00:00', '2014-10-03T09:15:00', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]")]